#include <REGX52.H>
#include "LCD1602.h"

//定时器0初始化函数
void Timer0_Init(){
	//配置定时器工作模式寄存器
	//该寄存器不可位寻址，只能整体赋值
	//将各位配置为0000 0001
	//其中将控制定时器0的低四位配置为0001
	//即定时器开关只由TR0控制，作为定时器使用，模式为16位定时器
	//TMOD = 0x01;
	//TMOD = TMOD&0xF0;
	//把TMOD的低四位清零，高四位保持不变
	//可简化为 TMOD &= 0xF0;
	//TMOD &= 0xF0;		//设置定时器模式
	//TMOD |= 0x01;		//把TMOD的高四位保持不变，低四位置0001
	
	//配置定时器控制寄存器
	//该寄存器可位寻址，可对每一位单独赋值
	//先将溢出中断标志置0
	//TF0 = 0;
	//让定时器开始工作
	//TR0 = 1;
	//给定时器高低位计数器赋初值，使其每隔1毫秒溢出一次，触发一次中断
	//只适用12MHZ晶振，其他频率晶振需要另算
	//TL0 = 0x00;		//设置定时初值
	//TH0 = 0xDC;		//设置定时初值
	
	//配置中断寄存器
	//允许T0中断
	ET0 = 1;
	//允许总中断
	EA = 1;
	//配置定时器0中断优先级
	//只设置了IP寄存器，配置T0中断为低优先级
	PT0 = 0;
	
	//AUXR &= 0x7F;		//定时器时钟12T模式
	TMOD &= 0xF0;		//设置定时器模式
	TMOD |= 0x01;		//设置定时器模式
	TL0 = 0x66;		//设置定时初值
	TH0 = 0xFC;		//设置定时初值
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
}

void main(){
	Timer0_Init();
	
	while(1){
		
	}
}

unsigned int t0Count = 0;

//该函数响应定时器0的中断，当触发T0中断时，执行该中断子程序
void Timer0_Routine() interrupt 1{
	
	//每次T0中断后计数器值置0，因此T0计数器需重新赋值
	TL0 = 0x66;		//设置定时初值
	TH0 = 0xFC;		//设置定时初值
	
	t0Count++;
	//驱动LCD屏实时显示数字会导致比较大的延迟
	//LCD_Init();
	//LCD_ShowNum(1,1,t0Count,5);
	if(t0Count >= 1000){
		t0Count = 0;
		P2_0 = !P2_0;
	}
}